name: "image-processor"
backend: "python"
max_batch_size: 0


input [
    {
        name: "IMAGE_B64"
        data_type: TYPE_STRING
        dims: [ 1 ]
    }
]

output [
    {
        name: "PREPROCESSED_IMAGE"
        data_type: TYPE_FP32
        dims: [ 1, 3, 256, 256 ]
    }
]
